In [1]:
import pandas as pd

In [2]:
data=pd.Series([4,8,15,16,23,42],index=[0,1,2,3,4,5])

In [5]:
type(data)

pandas.core.series.Series

In [6]:
data

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
l=[12,23,34,45,56,67,78,89,90,19]
df=pd.Series(l)
df

0    12
1    23
2    34
3    45
4    56
5    67
6    78
7    89
8    90
9    19
dtype: int64

In [11]:
df1=pd.DataFrame({'Name':['Alice','Bob','Claire'],
                  'Age':[25,30,27],
                  'Gender':['Female','Male','Female']
                 })

In [12]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In pandas, a DataFrame is a two-dimensional, tabular data structure that is widely used for data manipulation and analysis.
A Series in pandas is a one-dimensional array-like object that can hold any data type. It is similar to a column in a DataFrame.

In [13]:
# Example
df1=pd.DataFrame({'Name':['Alice','Bob','Claire'],
                  'Age':[25,30,27],
                  'Gender':['Female','Male','Female']
                 })

In [14]:
type(df1)

pandas.core.frame.DataFrame

In [15]:
type(df1['Name'])

pandas.core.series.Series

some common functions are:

In [16]:
df2=pd.DataFrame({'Name':['Alice','Bob','Claire','harish','abhishek','bharath'],
                  'Age':[25,30,27,34,25,19],
                  'Gender':['Female','Male','Female','Male','Male','Male']
                 })

In [17]:
df2

       Name  Age  Gender
0     Alice   25  Female
1       Bob   30    Male
2    Claire   27  Female
3    harish   34    Male
4  abhishek   25    Male
5   bharath   19    Male

In [18]:
# Head() function is used to display first 5 rows
df2.head()

       Name  Age  Gender
0     Alice   25  Female
1       Bob   30    Male
2    Claire   27  Female
3    harish   34    Male
4  abhishek   25    Male

In [19]:
# Tail() function is used to dispaly last 5 rows
df2.tail()

       Name  Age  Gender
1       Bob   30    Male
2    Claire   27  Female
3    harish   34    Male
4  abhishek   25    Male
5   bharath   19    Male

In [20]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Age     6 non-null      int64
 2   Gender  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [21]:
df2.describe()

             Age
count   6.000000
mean   26.666667
std     5.085928
min    19.000000
25%    25.000000
50%    26.000000
75%    29.250000
max    34.000000

In [28]:
df2.iloc[1:4,[0,1,2]]

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female
3  harish   34    Male

In [29]:
df2.loc[1:4,['Name','Age','Gender']]

       Name  Age  Gender
1       Bob   30    Male
2    Claire   27  Female
3    harish   34    Male
4  abhishek   25    Male

All three Series,DataFrame and Panel are mutable

In [33]:
d1=pd.Series([201,202,203,204,205])
d2=pd.Series(['Abhishek','Anusha','Alica','Bob','Akash'])
data={'Emp_Id':d1,'Emp_Name':d2}
pd.DataFrame(data)

   Emp_Id  Emp_Name
0     201  Abhishek
1     202    Anusha
2     203     Alica
3     204       Bob
4     205     Akash